[
  {
    "id": "beginner-1",
    "title": "Basic Islamic Terms",
    "summary": "Essential Islamic terminology for beginners on the spiritual path.",
    "tags": ["Terms", "Basics", "Vocabulary"],
    "content": [
      {
        "heading": "Common Terms",
        "body": "Dhikr: Remembrance of Allah through recitation of His names, Qur'anic verses, or supplications. Tariqa: A spiritual path or Sufi order. Shaykh: A spiritual guide or teacher. Wazifa: A daily litany or set of recitations. Wird: Regular spiritual practice. Silsila: The chain of spiritual transmission from teacher to student."
      },
      {
        "heading": "Spiritual Concepts",
        "body": "Tawhid: The oneness of Allah, the fundamental principle of Islam. Sunnah: The example and teachings of Prophet Muhammad (peace be upon him). Shari'ah: Islamic law derived from the Qur'an and Sunnah. Adab: Proper spiritual etiquette and conduct. Niyyah: Intention, the inner motivation behind actions."
      }
    ],
    "references": []
  },
  {
    "id": "beginner-2",
    "title": "Arabic Phrases for Daily Use",
    "summary": "Common Arabic phrases used in Islamic practice and daily life.",
    "tags": ["Arabic", "Phrases", "Daily Use"],
    "content": [
      {
        "heading": "Greetings and Responses",
        "body": "As-salamu alaykum: Peace be upon you (greeting). Wa alaykum as-salam: And upon you peace (response). Barakallahu fik: May Allah bless you. Jazakallahu khayran: May Allah reward you with good. Insha'Allah: If Allah wills. Alhamdulillah: Praise be to Allah. SubhanAllah: Glory be to Allah."
      },
      {
        "heading": "Supplications",
        "body": "Bismillah: In the name of Allah (said before beginning any action). Astaghfirullah: I seek forgiveness from Allah. La ilaha illa Allah: There is no god but Allah. Allahu Akbar: Allah is the Greatest. Hasbunallahu wa ni'mal wakeel: Allah is sufficient for us and He is the best disposer of affairs."
      }
    ],
    "references": []
  },
  {
    "id": "beginner-3",
    "title": "Understanding Salawat",
    "summary": "What salawat means and how to send blessings upon the Prophet.",
    "tags": ["Salawat", "Prophet", "Blessings"],
    "content": [
      {
        "heading": "What is Salawat?",
        "body": "Salawat (also spelled salat) refers to sending blessings and peace upon the Prophet Muhammad (peace be upon him). This is done through specific formulas that invoke Allah's blessings upon the Prophet and his family. Sending salawat is highly recommended in Islam and is a central practice in the Tijaniyah path."
      },
      {
        "heading": "Common Formulas",
        "body": "Allahumma salli 'ala Muhammad: O Allah, send blessings upon Muhammad. Allahumma salli 'ala Muhammad wa 'ala ali Muhammad: O Allah, send blessings upon Muhammad and the family of Muhammad. The Tijaniyah path includes specific formulas of salawat that are recited as part of daily practice."
      },
      {
        "heading": "Benefits and Significance",
        "body": "Sending salawat brings numerous spiritual benefits: it is a means of drawing closer to Allah, seeking the Prophet's intercession, expressing love and respect, and following Allah's command in the Qur'an. Regular recitation of salawat is considered a source of spiritual blessing and protection."
      }
    ],
    "references": []
  },
  {
    "id": "beginner-4",
    "title": "The Five Pillars of Islam",
    "summary": "A brief overview of the fundamental pillars of Islamic practice.",
    "tags": ["Pillars", "Fundamentals", "Islam"],
    "content": [
      {
        "heading": "The Five Pillars",
        "body": "The five pillars of Islam are: Shahadah (testimony of faith), Salah (five daily prayers), Zakat (obligatory charity), Sawm (fasting in Ramadan), and Hajj (pilgrimage to Mecca for those able). These are the fundamental obligations of every Muslim and form the foundation upon which all other practices, including spiritual practices, are built."
      },
      {
        "heading": "Foundation for Spiritual Practice",
        "body": "The Tijaniyah path emphasizes that spiritual practices complement but never replace these fundamental pillars. All Sufi practices, including the wazifa and lazim, are performed in addition to the five pillars, not as substitutes. A strong foundation in the pillars is essential for meaningful spiritual development."
      }
    ],
    "references": []
  },
  {
    "id": "beginner-5",
    "title": "Understanding Dhikr",
    "summary": "What dhikr is and its importance in Islamic spirituality.",
    "tags": ["Dhikr", "Remembrance", "Spirituality"],
    "content": [
      {
        "heading": "What is Dhikr?",
        "body": "Dhikr (remembrance) refers to the practice of remembering Allah through recitation of His names, Qur'anic verses, or supplications. It is one of the most important spiritual practices in Islam and is emphasized throughout the Qur'an and Hadith. Dhikr can be done individually or in groups, silently or aloud."
      },
      {
        "heading": "Forms of Dhikr",
        "body": "Dhikr can take many forms: reciting the names of Allah (such as 'Allah', 'SubhanAllah', 'Alhamdulillah', 'Allahu Akbar'), reciting specific formulas (such as 'La ilaha illa Allah'), reading the Qur'an, or engaging in any act that brings one's attention to Allah. The Tijaniyah path includes specific dhikr formulas as part of its daily practices."
      },
      {
        "heading": "Benefits of Dhikr",
        "body": "Regular dhikr brings numerous benefits: it purifies the heart, brings peace and tranquility, increases love for Allah, protects from sin, and draws one closer to the Divine. The Qur'an and Hadith contain many references to the importance and benefits of dhikr."
      }
    ],
    "references": []
  },
  {
    "id": "beginner-6",
    "title": "The Importance of Intention (Niyyah)",
    "summary": "Understanding the role of intention in Islamic practice.",
    "tags": ["Intention", "Niyyah", "Spirituality"],
    "content": [
      {
        "heading": "What is Niyyah?",
        "body": "Niyyah (intention) refers to the inner motivation and purpose behind one's actions. In Islam, the intention is crucial - it determines the spiritual value of an action. The Prophet (peace be upon him) said: 'Actions are judged by intentions.' A good intention can transform ordinary actions into acts of worship."
      },
      {
        "heading": "Sincere Intention",
        "body": "For spiritual practices to be meaningful, they must be done with sincere intention to seek Allah's pleasure. This means performing practices for the sake of Allah alone, not for show, social status, or worldly gain. The intention should be pure and focused on drawing closer to Allah and following the Prophet's example."
      },
      {
        "heading": "Renewing Intention",
        "body": "It is beneficial to regularly renew one's intention, especially before beginning spiritual practices. This helps maintain focus and sincerity. One should remind oneself why they are performing the practice and what they hope to achieve - ultimately, seeking Allah's pleasure and spiritual purification."
      }
    ],
    "references": []
  },
  {
    "id": "beginner-7",
    "title": "Understanding Wudu (Ablution)",
    "summary": "The importance of ritual purity in Islamic practice.",
    "tags": ["Wudu", "Purity", "Ablution"],
    "content": [
      {
        "heading": "What is Wudu?",
        "body": "Wudu (ablution) is the ritual washing performed before prayer and other acts of worship. It involves washing the hands, mouth, nose, face, arms, head, and feet in a specific order. Wudu is a means of physical and spiritual purification, preparing one for communication with Allah."
      },
      {
        "heading": "When Wudu is Required",
        "body": "Wudu is required before performing the five daily prayers, touching the Qur'an, and performing other acts of worship. It is also recommended before engaging in dhikr and other spiritual practices, as ritual purity enhances the spiritual experience. Wudu is invalidated by certain actions such as using the restroom or sleeping."
      },
      {
        "heading": "Spiritual Significance",
        "body": "Beyond physical cleanliness, wudu has spiritual significance. It is a reminder of the importance of purity in approaching Allah, both physically and spiritually. The act of wudu itself can be a form of dhikr if done with awareness and intention."
      }
    ],
    "references": []
  },
  {
    "id": "beginner-8",
    "title": "Respect and Etiquette (Adab)",
    "summary": "The importance of proper conduct and respect in Islamic practice.",
    "tags": ["Adab", "Etiquette", "Respect"],
    "content": [
      {
        "heading": "What is Adab?",
        "body": "Adab refers to proper conduct, etiquette, and good manners in Islamic tradition. It encompasses how one treats others, how one approaches spiritual practices, and how one conducts oneself in daily life. Adab is considered essential for spiritual development and is highly valued in the Tijaniyah path."
      },
      {
        "heading": "Adab with People",
        "body": "Proper adab includes: respecting elders, being kind to the young, honoring parents, treating all people with dignity regardless of their background, speaking truthfully and kindly, avoiding backbiting and slander, and serving others. These outward behaviors reflect and reinforce inner spiritual states."
      },
      {
        "heading": "Adab in Practice",
        "body": "When engaging in spiritual practices, adab includes: performing wudu when possible, facing the qibla if able, maintaining focus and presence of heart, avoiding distractions, and approaching practices with humility and reverence. Proper adab enhances the spiritual benefit of practices."
      }
    ],
    "references": []
  },
  {
    "id": "beginner-9",
    "title": "Finding a Teacher",
    "summary": "Guidance on finding and working with a spiritual teacher.",
    "tags": ["Teacher", "Shaykh", "Guidance"],
    "content": [
      {
        "heading": "The Importance of a Teacher",
        "body": "In the Tijaniyah path, having a qualified teacher (shaykh) is important for proper guidance. A teacher provides instruction in the practices, offers spiritual counsel, helps avoid errors, and provides support on the spiritual journey. While books and resources are valuable, personal guidance from a qualified teacher is irreplaceable."
      },
      {
        "heading": "Qualities of a Good Teacher",
        "body": "A good teacher should be: knowledgeable in Islamic sciences, authorized to teach the path, of good character, patient and understanding, accessible for guidance, and committed to the student's spiritual development. The teacher should emphasize adherence to Islamic law and the Sunnah."
      },
      {
        "heading": "The Student-Teacher Relationship",
        "body": "The relationship with a teacher is based on respect, trust, and sincere seeking. The student should follow guidance while maintaining personal responsibility. This relationship is not one of blind obedience but of informed trust within the framework of Islamic teachings. Both teacher and student should maintain proper adab."
      }
    ],
    "references": []
  },
  {
    "id": "beginner-10",
    "title": "Common Questions for Beginners",
    "summary": "Answers to frequently asked questions by those new to the path.",
    "tags": ["FAQ", "Questions", "Beginners"],
    "content": [
      {
        "heading": "Do I need to leave my current practices?",
        "body": "No, the Tijaniyah path does not require abandoning other beneficial practices. However, one should ensure that all practices are in accordance with Islamic law and do not conflict with the authorized Tijaniyah teachings. It is best to consult with a qualified teacher about integrating practices."
      },
      {
        "heading": "How long should practices take?",
        "body": "The time required varies, but typically the daily wazifa and lazim together may take 30-60 minutes, depending on one's pace and the specific practices. It is better to perform practices correctly and with presence of heart than to rush through them. Consistency is more important than speed."
      },
      {
        "heading": "What if I miss a day?",
        "body": "If one misses a day of practice, they should simply resume the next day without excessive worry. The path emphasizes consistency and effort, not perfection. However, one should strive to maintain regular practice and avoid making excuses. If missing practices becomes habitual, it may indicate a need to reassess one's commitment."
      }
    ],
    "references": []
  }
]

