[
  {
    "id": "fiqh-1",
    "title": "Conditions for Entering Tijaniyah",
    "summary": "The prerequisites and conditions for joining the Tijaniyah path.",
    "tags": ["Conditions", "Entry", "Requirements"],
    "content": [
      {
        "heading": "Basic Requirements",
        "body": "To enter the Tijaniyah path, one must be a Muslim who believes in the fundamentals of Islam, has reached the age of maturity, and has the intention to follow the path sincerely. There is no requirement for prior spiritual training, though a basic understanding of Islamic teachings is beneficial."
      },
      {
        "heading": "Sincere Intention",
        "body": "The most important condition is sincere intention (niyyah). One should enter the path seeking Allah's pleasure and spiritual purification, not for worldly gain or social status. The intention should be pure and focused on drawing closer to Allah through following the Prophet's example."
      },
      {
        "heading": "Commitment to Practice",
        "body": "Entering the path requires a commitment to perform the prescribed practices regularly. This includes the daily wazifa, lazim, and other recommended practices. The commitment should be realistic and sustainable, taking into account one's circumstances while maintaining consistency."
      }
    ],
    "references": []
  },
  {
    "id": "fiqh-2",
    "title": "Obligations of the Tijani",
    "summary": "The religious and spiritual obligations specific to followers of the Tijaniyah path.",
    "tags": ["Obligations", "Duties", "Requirements"],
    "content": [
      {
        "heading": "Primary Obligations",
        "body": "The primary obligations of a Tijani include: performing the five daily prayers on time, observing all obligatory fasts, giving zakat if applicable, performing Hajj if able, and maintaining all other obligatory acts of worship. The Tijaniyah practices are additional, not replacements for these fundamentals."
      },
      {
        "heading": "Daily Practices",
        "body": "In addition to obligatory worship, the Tijani is expected to perform the daily wazifa and lazim. These practices are considered essential for spiritual development on the path. While they are not fard (obligatory) in the legal sense, they are required for those who have committed to the path."
      },
      {
        "heading": "Adherence to Shari'ah",
        "body": "Strict adherence to Islamic law (Shari'ah) is fundamental. The Tijaniyah path does not provide exemptions from religious obligations. Rather, it emphasizes the importance of fulfilling all religious duties while engaging in additional spiritual practices."
      }
    ],
    "references": []
  },
  {
    "id": "fiqh-3",
    "title": "Prohibitions and Restrictions",
    "summary": "What is prohibited or restricted for followers of the Tijaniyah path.",
    "tags": ["Prohibitions", "Restrictions", "Guidelines"],
    "content": [
      {
        "heading": "General Prohibitions",
        "body": "All actions prohibited in Islam remain prohibited for the Tijani. This includes consuming intoxicants, engaging in usury, backbiting, slander, and all other sins. The path emphasizes avoiding not only major sins but also minor sins and anything that distances one from Allah."
      },
      {
        "heading": "Spiritual Restrictions",
        "body": "The path prohibits certain spiritual practices that are not part of the authorized Tijaniyah teachings. This includes unauthorized litanies, practices from other orders without proper authorization, and any innovations that contradict the established teachings. The emphasis is on following the authorized practices of the order."
      },
      {
        "heading": "Respect for Other Paths",
        "body": "While following the Tijaniyah path, one should not disparage other legitimate Sufi orders or Islamic schools of thought. The path teaches respect for all Muslims and their various approaches to spirituality, while maintaining commitment to one's own path."
      }
    ],
    "references": []
  },
  {
    "id": "fiqh-4",
    "title": "Women in Tijaniyah",
    "summary": "The role and rights of women in the Tijaniyah path.",
    "tags": ["Women", "Rights", "Participation"],
    "content": [
      {
        "heading": "Equal Spiritual Status",
        "body": "Women have equal spiritual status in the Tijaniyah path. They can receive initiation, perform all the practices, and progress spiritually just as men can. The path does not discriminate based on gender in matters of spiritual development and access to teachings."
      },
      {
        "heading": "Practical Considerations",
        "body": "While spiritual status is equal, practical considerations related to Islamic modesty and social norms are observed. Women may have separate gatherings for zikr, separate spaces for learning, and accommodations that respect Islamic guidelines for gender interaction while maintaining full access to spiritual teachings."
      }
    ],
    "references": []
  },
  {
    "id": "fiqh-5",
    "title": "Leaving the Path",
    "summary": "Guidelines regarding leaving or changing spiritual paths.",
    "tags": ["Leaving", "Guidelines", "Ethics"],
    "content": [
      {
        "heading": "Freedom of Choice",
        "body": "Islam recognizes the freedom of individuals to choose their spiritual path. If someone feels that the Tijaniyah path is not suitable for them, they are free to leave. However, this should be done respectfully and without disparaging the path or its practitioners."
      },
      {
        "heading": "Proper Conduct",
        "body": "If one decides to leave, it should be done with proper adab (etiquette). This includes informing one's shaykh if possible, not speaking ill of the path, and maintaining respect for those who continue on the path. The decision should be made after careful consideration and consultation."
      }
    ],
    "references": []
  },
  {
    "id": "fiqh-6",
    "title": "Marriage and Family",
    "summary": "Guidelines for marriage and family life within the Tijaniyah context.",
    "tags": ["Marriage", "Family", "Relationships"],
    "content": [
      {
        "heading": "Marriage Guidelines",
        "body": "Marriage in the Tijaniyah path follows standard Islamic guidelines. There is no requirement to marry within the order, though many practitioners find it beneficial to have a spouse who shares their spiritual commitment. The emphasis is on finding a righteous spouse who supports one's spiritual development."
      },
      {
        "heading": "Family Life",
        "body": "The path emphasizes the importance of fulfilling family obligations. Spiritual practices should not come at the expense of family responsibilities. Rather, the practices should enhance one's ability to be a good spouse, parent, and family member, reflecting the spiritual values in daily life."
      }
    ],
    "references": []
  },
  {
    "id": "fiqh-7",
    "title": "Business and Trade",
    "summary": "Ethical guidelines for business and economic activities.",
    "tags": ["Business", "Ethics", "Trade"],
    "content": [
      {
        "heading": "Ethical Business Practices",
        "body": "The Tijaniyah path emphasizes ethical business practices in accordance with Islamic law. This includes avoiding usury (riba), engaging in fair trade, honoring contracts, and treating employees and customers justly. Business success should not come at the expense of religious principles."
      },
      {
        "heading": "Spiritual Balance",
        "body": "While engaging in business, one should maintain spiritual balance. This includes performing prayers on time, maintaining daily practices, and not allowing worldly concerns to overshadow spiritual development. Business success is seen as a means to serve Allah and the community, not an end in itself."
      }
    ],
    "references": []
  },
  {
    "id": "fiqh-8",
    "title": "Education and Knowledge",
    "summary": "The importance of seeking knowledge in the Tijaniyah path.",
    "tags": ["Education", "Knowledge", "Learning"],
    "content": [
      {
        "heading": "Seeking Knowledge",
        "body": "The Tijaniyah path strongly encourages seeking both religious and worldly knowledge. This includes studying the Qur'an, Hadith, Islamic law, and other religious sciences, as well as beneficial worldly knowledge. Knowledge is seen as a means of serving Allah and the community."
      },
      {
        "heading": "Balance of Knowledge",
        "body": "The path emphasizes a balance between spiritual practice and knowledge acquisition. Mere knowledge without practice is insufficient, and practice without knowledge can lead to error. The ideal is to combine sound knowledge with sincere practice, each reinforcing the other."
      }
    ],
    "references": []
  }
]

